{
    "technos": [
        {
            "iconClass": "fontisto:python",
            "label": "Python",
            "description": "Python est un langage de programmation incroyablement polyvalent, largement adopté pour des tâches variées telles que l'automatisation, l'analyse de données, l'intelligence artificielle, ainsi que le développement web.<br><br>J'ai découvert Python durant mon BTS, et ce fut un véritable coup de cœur. Ce langage est rapidement devenu mon favori grâce à sa simplicité, son intuitivité, et sa grande polyvalence. L'énorme quantité de bibliothèques développées par la communauté permet d'éviter de réinventer la roue à chaque projet, ce qui est un atout majeur.<br><br>Ma passion pour Python m'a conduit à approfondir mes compétences en suivant des formations spécialisées, jusqu'à obtenir la certification PCEP du Python Institute, témoignant de ma maîtrise de cette technologie. Depuis, Python est resté mon outil de prédilection, que j'utilise aussi bien pour mes projets personnels que dans mon quotidien professionnel.<br><br>Pour mes projets personnels, j'ai exploité Python de multiples façons : création de jeux avec Pygame, machine learning avec Matplotlib, Pandas et Scikit-Learn, web scraping avec BeautifulSoup, et développement de scripts d'automatisation.<br><br>Chez Sopra Steria, j'ai surtout mis Python à profit dans un projet dont j'étais le responsable technique. Ce projet, en lien avec AWS, impliquait le développement de lambdas pour la gestion de flux critiques chez Teréga, mettant en évidence l'importance stratégique de cette technologie."
        },
        {
            "iconClass": "fa6-brands:aws",
            "label": "SDK AWS",
            "description": "AWS SDK permet aux développeurs d'intégrer facilement les services Amazon Web Services dans leurs applications avec des bibliothèques, exemples de code, et documentation.<br><br>Ce SDK m'a permis de développer des solutions robustes et évolutives, tout en m'épargnant de nombreux défis techniques. J'ai notamment utilisé le SDK AWS pour orchestrer des flux de données, et nottament exploiter des services tels que les lambdas AWS pour le mapping des données des flux, SES pour l'envoi d'e-mails, SQS pour la gestion des files d'attente de messages, S3 pour le stockage d'objets, et DynamoDB pour des bases de données NoSQL performantes. Ces outils m'ont été indispensables, notamment dans un projet avec Teréga, où la gestion de ces flux était d'une importance capitale. Aujourd'hui, je continue d'apprécier et d'exploiter le SDK AWS pour son efficacité et sa capacité à simplifier le développement sur le cloud."
        },
        {
            "iconClass": "cib:angular",
            "label": "Angular",
            "description": "Angular est un framework open-source développé par Google pour créer des applications web dynamiques et riches en fonctionnalités côté client.<br><br>J'ai commencé à apprendre Angular de manière autodidacte, motivé par l'envie d'acquérir des compétences dans un framework web moderne. Sans aucune formation préalable, j'ai plongé directement dans l'apprentissage sur le tas, en explorant les nombreuses fonctionnalités offertes par Angular.<br><br>Au fil du temps, et à travers divers projets, j'ai progressivement maîtrisé cette technologie, notamment la version 17, avec laquelle j'ai travaillé sur plusieurs applications, comme par exemple ce portfolio, ou encore mon plus gros projet : PokerHL. Au fur et à mesure des projets, mon parcours m'a permis de comprendre en profondeur les concepts du framework.<br><br>Aujourd'hui, Angular est devenu l'un de mes outils préférés pour le développement web. J'apprécie particulièrement sa robustesse et sa flexibilité, qui me permettent de créer des applications performantes et évolutives. C'est une technologie que je prends plaisir à utiliser et à recommander pour tout projet web ambitieux."
        },
        {
            "iconClass": "uiw:html5",
            "label": "HTML",
            "description": "HTML (HyperText Markup Language) est le langage standard utilisé pour créer et structurer des pages web.HTML est la base incontournable de tout développement web.<br><br>Dès mes débuts, j'ai rapidement compris l'importance de maîtriser ce langage, car il constitue le fondement de toute structure de page web. Au fil des projets, j'ai acquis une solide expertise en HTML, ce qui me permet aujourd'hui de l'utiliser avec aisance dans une grande variété de contextes.<br><br>Que ce soit pour créer des interfaces utilisateur simples ou pour structurer des pages complexes, HTML est toujours au cœur de mes développements. J'ai eu l'occasion de l'intégrer dans de nombreux projets, qu'il s'agisse de sites web statiques, d'applications dynamiques ou de composants front-end dans des frameworks plus avancés. Aujourd'hui, je suis parfaitement rodé avec ce langage, qui reste un outil indispensable dans mon quotidien de développeur web."
        },
        {
            "iconClass": "uiw:css3",
            "label": "CSS",
            "description": "CSS (Cascading Style Sheets) est un langage de feuille de style utilisé pour décrire la présentation d'un document HTML.<br><br>CSS va naturellement de pair avec HTML, formant le duo essentiel pour tout développement web. Dès que j'ai commencé à travailler avec HTML, j'ai aussi appris à maîtriser CSS pour donner vie aux interfaces, en stylisant et en structurant les pages web de manière efficace. Contrairement à beaucoup de mes collègues développeurs qui voient CSS comme une tâche fastidieuse, j'ai toujours apprécié son utilisation. J'aime jouer avec les styles, les animations, et les mises en page pour créer des designs attrayants, fonctionnels mais tout en restant intuitifs.<br><br>Au fil des projets, j'ai utilisé CSS autant que HTML, prenant plaisir à explorer toutes les possibilités qu'il offre. Cependant, avec l'évolution des technologies, j'ai progressivement migré vers Tailwind CSS, qui simplifie grandement le processus de stylisation. Aujourd'hui, bien que je n'utilise plus vraiment CSS pur, mes connaissances approfondies de cette technologie continuent de m'être utiles dans mon travail avec Tailwind."
        },
        {
            "iconClass": "bi:git",
            "label": "Git",
            "description": "Git est un système de contrôle de version décentralisé qui permet aux développeurs de suivre les modifications de code et de travailler en collaboration."
        },
        {
            "iconClass": "simple-icons:php",
            "label": "PHP",
            "description": "PHP est un langage de script côté serveur principalement utilisé pour le développement de pages web dynamiques."
        },
        {
            "iconClass": "akar-icons:javascript-fill",
            "label": "Javascript",
            "description": "JavaScript est un langage de programmation côté client utilisé pour créer des interactions dynamiques sur les pages web."
        },
        {
            "iconClass": "fa6-brands:java",
            "label": "Java",
            "description": "Java est un langage de programmation orienté objet largement utilisé pour le développement d'applications web, mobiles, et d'entreprise."
        },
        {
            "iconClass": "devicon-plain:nodejs-wordmark",
            "label": "Node JS",
            "description": "Node.js est un environnement d'exécution JavaScript côté serveur qui permet de créer des applications web rapides et évolutives."
        },
        {
            "iconClass": "devicon-plain:csharp",
            "label": "C#",
            "description": "C# est un langage de programmation orienté objet développé par Microsoft, utilisé principalement pour le développement d'applications Windows et .NET."
        },
        {
            "iconClass": "simple-icons:express",
            "label": "Express",
            "description": "Express est un framework web minimaliste pour Node.js, utilisé pour créer des applications web et API robustes et rapides."
        },
        {
            "iconClass": "akar-icons:typescript-fill",
            "label": "TypeScript",
            "description": "TypeScript est un sur-ensemble de JavaScript qui ajoute des types statiques optionnels et des fonctionnalités modernes, facilitant la maintenance de code à grande échelle."
        },
        {
            "iconClass": "ri:tailwind-css-fill",
            "label": "Tailwind CSS",
            "description": "Tailwind CSS est un framework CSS utilitaire qui permet de créer des interfaces utilisateur rapidement en utilisant des classes pré-définies directement dans le HTML."
        },
        {
            "iconClass": "cib:terraform",
            "label": "Terraform",
            "description": "Terraform est un outil d'infrastructure en tant que code (IaC) qui permet de définir et de provisionner des ressources cloud de manière automatisée."
        },
        {
            "iconClass": "mdi:sql-query",
            "label": "PL/SQL",
            "description": "PL/SQL est une extension du langage SQL utilisée principalement dans les bases de données Oracle pour écrire des procédures stockées et des scripts complexes."
        },
        {
            "iconClass": "mdi:dot-net",
            "label": ".NET",
            "description": ".NET est un framework de développement de Microsoft permettant de créer des applications pour Windows, le web, et le cloud, en utilisant divers langages de programmation."
        },
        {
            "iconClass": "simple-icons:mongodb",
            "label": "Mongo DB",
            "description": "MongoDB est une base de données NoSQL orientée documents, populaire pour le stockage de données non structurées et semi-structurées."
        },
        {
            "iconClass": "cib:cplusplus",
            "label": "C++",
            "description": "C++ est un langage de programmation orienté objet utilisé pour le développement de logiciels, de jeux vidéo, et de systèmes embarqués nécessitant des performances élevées."
        },
        {
            "iconClass": "devicon-plain:bash",
            "label": "Bash",
            "description": "Bash est un shell Unix et un langage de commande utilisé pour écrire des scripts permettant d'automatiser les tâches sur les systèmes Linux et Unix."
        },
        {
            "iconClass": "uil:android",
            "label": "SDK Android",
            "description": "Le SDK Android est un ensemble d'outils de développement logiciel fourni par Google pour créer des applications pour le système d'exploitation Android."
        },
        {
            "iconClass": "cib:ionic",
            "label": "Ionic",
            "description": "Ionic est un framework open-source pour le développement d'applications mobiles multiplateformes utilisant des technologies web comme HTML, CSS, et JavaScript."
        },
        {
            "iconClass": "simple-icons:neo4j",
            "label": "Cypher",
            "description": "Cypher est un langage de requête utilisé pour interroger les bases de données graphes Neo4j, permettant de manipuler et de récupérer des données connectées."
        },
        {
            "iconClass": "simple-icons:lua",
            "label": "Lua",
            "description": "Lua est un langage de script léger et flexible, souvent utilisé pour les scripts embarqués dans les jeux vidéo et d'autres applications nécessitant des performances."
        },
        {
            "iconClass": "simple-icons:autohotkey",
            "label": "AHK",
            "description": "AutoHotkey (AHK) est un langage de script open-source utilisé principalement pour l'automatisation des tâches sous Windows."
        }
    ]
}